using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using static System.Windows.Forms.VisualStyles.VisualStyleElement.Window;

namespace SurvLine
{
    public class ProcessInterface
    {
        //==========================================================================================
        /*[VB]
        '*******************************************************************************
        '処理インターフェース

        Option Explicit
        [VB]*/
        //------------------------------------------------------------------------------------------
        //[C#]
        //==========================================================================================

        //==========================================================================================
        /*[VB]
        '*******************************************************************************
        'メソッド

        '処理。
        '
        '引き数：
        'clsProgressInterface ProgressInterface オブジェクト。
        Public Sub Process(ByVal clsProgressInterface As ProgressInterface)
        End Sub
        [VB]*/
        //------------------------------------------------------------------------------------------
        //[C#]
        /*
        '*******************************************************************************
        'メソッド

        '処理。
        '
        '引き数：
        'clsProgressInterface ProgressInterface オブジェクト。
        */
        public void Process(ProgressInterface clsProgressInterface)
        {
            return;
        }
        //==========================================================================================

        //==========================================================================================
        /*[VB]
        'キャンセル確認。
        '
        '戻り値：
        'キャンセルが指定されている場合は True を返す。
        'それ以外の場合は False を返す。
        Public Function ConfirmCancel() As Boolean
        End Function
        [VB]*/
        //------------------------------------------------------------------------------------------
        //[C#]
        /*
        'キャンセル確認。
        '
        '戻り値：
        'キャンセルが指定されている場合は True を返す。
        'それ以外の場合は False を返す。
        */
        public bool ConfirmCancel()
        {
            return false;
        }
        //==========================================================================================
    }
}
