using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using static System.Windows.Forms.VisualStyles.VisualStyleElement.Window;

namespace SurvLine
{
    public class TwipsPoint
    {
        //==========================================================================================
        /*[VB]
        '*******************************************************************************
        'Twips位置

        Option Explicit
        [VB]*/
        //------------------------------------------------------------------------------------------
        //[C#]
        //==========================================================================================

        //==========================================================================================
        /*[VB]
        'プロパティ
        Public X As Double 'X。
        Public Y As Double 'Y。
        [VB]*/
        //------------------------------------------------------------------------------------------
        //[C#]
        //'プロパティ
        public double X;    //'X。
        public double Y;    //'Y。
        //==========================================================================================

        //==========================================================================================
        /*[VB]
        '*******************************************************************************
        'プロパティ

        'Twips位置。
        '
        'このプロパティはデフォルトプロパティである。Letを使えば｢値の代入｣ができる。いわゆるC++で言うところのoperator=である。
        '
        '引き数：
        'clsTwipsPoint コピー元のオブジェクト。
        Property Let TwipsPoint(ByVal clsTwipsPoint As TwipsPoint)
            X = clsTwipsPoint.X
            Y = clsTwipsPoint.Y
        End Property
        [VB]*/
        //------------------------------------------------------------------------------------------
        //[C#]
        /*
        '*******************************************************************************
        'プロパティ
        
        'Twips位置。
        '
        'このプロパティはデフォルトプロパティである。Letを使えば｢値の代入｣ができる。いわゆるC++で言うところのoperator=である。
        '
        '引き数：
        'clsTwipsPoint コピー元のオブジェクト。
        */
        public void TWipsPoint(TwipsPoint clsTwipsPoint)
        {
            X = clsTwipsPoint.X;
            Y = clsTwipsPoint.Y;
            return;
        }
        //==========================================================================================
    }
}
